-- Создание таблицы properties
CREATE TABLE IF NOT EXISTS properties (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255),
    address VARCHAR(255),
    floor INT,
    area FLOAT,
    type VARCHAR(50),
    metro TEXT[]
);

-- Добавление тестовых данных в таблицу
INSERT INTO properties (name, address, floor, area, type, metro) VALUES
('Объект 1', 'Адрес 1', 1, 50.5, 'квартира', ARRAY['Станция1', 'Станция2']),
('Объект 2', 'Адрес 2', 2, 70.0, 'апартаменты', ARRAY['Станция2', 'Станция3']),
('Объект 3', 'Адрес 3', 3, 55.0, 'пентхаус', ARRAY['Станция3', 'Станция4']),
('Объект 4', 'Адрес 4', 4, 60.0, 'квартира', ARRAY['Станция2']),
('Объект 5', 'Адрес 5', 5, 72.5, 'апартаменты', ARRAY['Станция5']),
('Объект 6', 'Адрес 6', 6, 48.0, 'пентхаус', ARRAY['Станция6', 'Станция1']),
('Объект 7', 'Адрес 7', 7, 52.5, 'квартира', ARRAY['Станция3', 'Станция4']),
('Объект 8', 'Адрес 8', 8, 65.0, 'апартаменты', ARRAY['Станция2', 'Станция5']),
('Объект 9', 'Адрес 9', 9, 75.0, 'пентхаус', ARRAY['Станция1']),
('Объект 10', 'Адрес 10', 10, 80.0, 'квартира', ARRAY['Станция5', 'Станция6']),
('Объект 11', 'Адрес 11', 11, 58.0, 'апартаменты', ARRAY['Станция6', 'Станция1']),
('Объект 12', 'Адрес 12', 12, 62.5, 'пентхаус', ARRAY['Станция1', 'Станция2']),
('Объект 13', 'Адрес 13', 13, 52.0, 'квартира', ARRAY['Станция3']),
('Объект 14', 'Адрес 14', 14, 68.0, 'апартаменты', ARRAY['Станция2', 'Станция4']),
('Объект 15', 'Адрес 15', 15, 73.5, 'пентхаус', ARRAY['Станция5']),
('Объект 16', 'Адрес 16', 16, 53.0, 'квартира', ARRAY['Станция6', 'Станция3']),
('Объект 17', 'Адрес 17', 17, 59.5, 'апартаменты', ARRAY['Станция1', 'Станция3']),
('Объект 18', 'Адрес 18', 18, 63.0, 'пентхаус', ARRAY['Станция4']),
('Объект 19', 'Адрес 19', 19, 54.0, 'квартира', ARRAY['Станция5', 'Станция6']),
('Объект 20', 'Адрес 20', 20, 76.0, 'апартаменты', ARRAY['Станция2', 'Станция3']);

